# Phase 1: Data Preparation

## 1. Project Setup and Data Loading
Import necessary libraries and load the datasets.

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import json

# Set plot style
sns.set(style="whitegrid")

# Load datasets
portfolio = pd.read_csv('../data/portfolio.csv')
profile = pd.read_csv('../data/profile.csv')
transcript = pd.read_csv('../data/transcript.csv')

print("Datasets loaded successfully.")

Datasets loaded successfully.

## 2. Initial Data Inspection
Display head, info, and shape for each DataFrame to understand the structure. Check for duplicates.

In [3]:
# Inspect Portfolio
print("Portfolio Shape:", portfolio.shape)
display(portfolio.head())
print("Portfolio Info:")
print(portfolio.info())
print("Portfolio Duplicates:", portfolio.duplicated().sum())

# Inspect Profile
print("\nProfile Shape:", profile.shape)
display(profile.head())
print("Profile Info:")
print(profile.info())
print("Profile Duplicates:", profile.duplicated().sum())

# Inspect Transcript
print("\nTranscript Shape:", transcript.shape)
display(transcript.head())
print("Transcript Info:")
print(transcript.info())
print("Transcript Duplicates:", transcript.duplicated().sum())

Portfolio Shape: (10, 7)

,Unnamed: 0,reward,channels,difficulty,duration,offer_type,id
0,0,10,"['email', 'mobile', 'social']",10,7,bogo,ae264e3637204a6fb9bb56bc8210ddfd
1,1,10,"['web', 'email', 'mobile', 'social']",10,5,bogo,4d5c57ea9a6940dd891ad53e9dbe8da0
2,2,0,"['web', 'email', 'mobile']",0,4,informational,3f207df678b143eea3cee63160fa8bed
3,3,5,"['web', 'email', 'mobile']",5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9
4,4,5,"['web', 'email']",20,10,discount,0b1e1539f2cc45b7b9fa7c272da2e1d7

Portfolio Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  10 non-null     int64
 1   reward      10 non-null     int64
 2   channels    10 non-null     object
 3   difficulty  10 non-null     int64
 4   duration    10 non-null     int64
 5   offer_type  10 non-null     object
 6   id          10 non-null     object
dtypes: int64(4), object(3)
memory usage: 692.0+ bytes
None
Portfolio Duplicates: 0

Profile Shape: (17000, 6)

,Unnamed: 0,gender,age,id,became_member_on,income
0,0,NaN,118,68be06ca386d4c31939f3a4f0e3dd783,20170212,NaN
1,1,F,55,0610b486422d4921ae7d2bf64640c50b,20170715,112000.0
2,2,NaN,118,38fe809add3b4fcf9315a9694bb96ff5,20180712,NaN
3,3,F,75,78afa995795e4d85b5d9ceeca43f5fef,20170509,100000.0
4,4,NaN,118,a03223e636434f42ac4c3df47e8bac43,20170804,NaN

Profile Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        17000 non-null  int64
 1   gender            14825 non-null  object
 2   age               17000 non-null  int64
 3   id                17000 non-null  object
 4   became_member_on  17000 non-null  int64
 5   income            14825 non-null  float64
dtypes: float64(1), int64(3), object(2)
memory usage: 797.0+ KB
None
Profile Duplicates: 0

Transcript Shape: (306534, 5)

,Unnamed: 0,person,event,value,time
0,0,78afa995795e4d85b5d9ceeca43f5fef,offer received,{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9'},0
1,1,a03223e636434f42ac4c3df47e8bac43,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0
2,2,e2127556f4f64592b11af22de27a7932,offer received,{'offer id': '2906b810c7d4411798c6938adc9daaa5'},0
3,3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,{'offer id': 'fafdcd668e3743c1bb461111dcafc2a4'},0
4,4,68617ca6246f4fbc85e91a2a49552598,offer received,{'offer id': '4d5c57ea9a6940dd891ad53e9dbe8da0'},0

Transcript Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 306534 entries, 0 to 306533
Data columns (total 5 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  306534 non-null  int64
 1   person      306534 non-null  object
 2   event       306534 non-null  object
 3   value       306534 non-null  object
 4   time        306534 non-null  int64
dtypes: int64(2), object(3)
memory usage: 11.7+ MB
None
Transcript Duplicates: 0

## 3. Data Cleaning: Profile Dataset
Handle null values in `income` and `gender`. Convert `became_member_on` to datetime format. Investigate and clean age outliers (e.g., age 118 often signifies missing data).

In [4]:
# Handle Age 118 (Missing Data)
# Age 118 corresponds to missing gender and income
print("Rows with age 118:", profile[profile['age'] == 118].shape[0])

# Replace 118 with NaN for age, or drop these rows if they lack critical info
# Strategy: Drop them as they have no income/gender info which is crucial for segmentation
profile_clean = profile.copy()
profile_clean = profile_clean[profile_clean['age'] != 118]

# Verify nulls handled
print("Remaining nulls in profile_clean:\n", profile_clean.isnull().sum())

# Convert became_member_on to datetime
profile_clean['became_member_on'] = pd.to_datetime(profile_clean['became_member_on'], format='%Y%m%d')

# Calculate Membership Days (assuming analysis date is the max date in dataset or current date)
# Let's use the max date from the data or a fixed reference date used in similar analyses
reference_date = profile_clean['became_member_on'].max()
profile_clean['membership_days'] = (reference_date - profile_clean['became_member_on']).dt.days

display(profile_clean.head())
print(profile_clean.info())

Rows with age 118: 2175
Remaining nulls in profile_clean:
 Unnamed: 0          0
gender              0
age                 0
id                  0
became_member_on    0
income              0
dtype: int64

,Unnamed: 0,gender,age,id,became_member_on,income,membership_days
1,1,F,55,0610b486422d4921ae7d2bf64640c50b,2017-07-15,112000.0,376
3,3,F,75,78afa995795e4d85b5d9ceeca43f5fef,2017-05-09,100000.0,443
5,5,M,68,e2127556f4f64592b11af22de27a7932,2018-04-26,70000.0,91
8,8,M,65,389bc3fa690240e798340f5a15918d5c,2018-02-09,53000.0,167
12,12,M,58,2eeac8d8feae4a8cad5a6af0499a211d,2017-11-11,51000.0,257

<class 'pandas.core.frame.DataFrame'>
Index: 14825 entries, 1 to 16999
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        14825 non-null  int64
 1   gender            14825 non-null  object
 2   age               14825 non-null  int64
 3   id                14825 non-null  object
 4   became_member_on  14825 non-null  datetime64[ns]
 5   income            14825 non-null  float64
 6   membership_days   14825 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(3), object(2)
memory usage: 926.6+ KB
None

## 4. Data Cleaning: Portfolio Dataset
One-hot encode the `channels` column (web, email, mobile, social) to make them usable features. Rename id column to `offer_id`.

In [5]:
portfolio_clean = portfolio.copy()

# Rename id to offer_id
portfolio_clean.rename(columns={'id': 'offer_id'}, inplace=True)

# One-hot encode channels
channels = ['web', 'email', 'mobile', 'social']

for channel in channels:
    portfolio_clean[channel] = portfolio_clean['channels'].apply(lambda x: 1 if channel in x else 0)

portfolio_clean.drop('channels', axis=1, inplace=True)

display(portfolio_clean.head())

,Unnamed: 0,reward,difficulty,duration,offer_type,offer_id,web,email,mobile,social
0,0,10,10,7,bogo,ae264e3637204a6fb9bb56bc8210ddfd,0,1,1,1
1,1,10,10,5,bogo,4d5c57ea9a6940dd891ad53e9dbe8da0,1,1,1,1
2,2,0,0,4,informational,3f207df678b143eea3cee63160fa8bed,1,1,1,0
3,3,5,5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9,1,1,1,0
4,4,5,20,10,discount,0b1e1539f2cc45b7b9fa7c272da2e1d7,1,1,0,0

## 5. Data Transformation: Transcript Dataset
Extract values from the `value` dictionary column (e.g., offer id, amount). Separate transaction events from offer events (received, viewed, completed). Rename `person` to `customer_id`.

In [7]:
transcript_clean = transcript.copy()

# Rename person to customer_id
transcript_clean.rename(columns={'person': 'customer_id'}, inplace=True)

# Parse 'value' column
import ast

def clean_value(val):
    if isinstance(val, str):
        val = ast.literal_eval(val)
    return val

transcript_clean['value'] = transcript_clean['value'].apply(clean_value)

# OPTIMIZED: Vectorized extraction instead of slow row-wise apply
# Convert list of dictionaries directly to a DataFrame
values_df = pd.DataFrame(transcript_clean['value'].tolist())

# Handle inconsistency between 'offer id' and 'offer_id'
if 'offer id' in values_df.columns:
    # Coalesce 'offer id' into 'offer_id'
    values_df['offer_id'] = values_df['offer_id'].combine_first(values_df['offer id'])
    values_df.drop(columns=['offer id'], inplace=True)

# Concatenate back to original dataframe
transcript_clean = pd.concat([transcript_clean, values_df], axis=1)

display(transcript_clean.head())
print("Event Counts:\n", transcript_clean.event.value_counts())

,Unnamed: 0,customer_id,event,value,time,amount,offer_id,reward
0,0,78afa995795e4d85b5d9ceeca43f5fef,offer received,{'offer id': '9b98b8c7a33c4b65b9aebfe6a799e6d9'},0,NaN,9b98b8c7a33c4b65b9aebfe6a799e6d9,NaN
1,1,a03223e636434f42ac4c3df47e8bac43,offer received,{'offer id': '0b1e1539f2cc45b7b9fa7c272da2e1d7'},0,NaN,0b1e1539f2cc45b7b9fa7c272da2e1d7,NaN
2,2,e2127556f4f64592b11af22de27a7932,offer received,{'offer id': '2906b810c7d4411798c6938adc9daaa5'},0,NaN,2906b810c7d4411798c6938adc9daaa5,NaN
3,3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,{'offer id': 'fafdcd668e3743c1bb461111dcafc2a4'},0,NaN,fafdcd668e3743c1bb461111dcafc2a4,NaN
4,4,68617ca6246f4fbc85e91a2a49552598,offer received,{'offer id': '4d5c57ea9a6940dd891ad53e9dbe8da0'},0,NaN,4d5c57ea9a6940dd891ad53e9dbe8da0,NaN

Event Counts:
 event
transaction        138953
offer received      76277
offer viewed        57725
offer completed     33579
Name: count, dtype: int64

## 6. Feature Engineering: Customer 360 View
Merge the cleaned datasets to create a single view per customer. Aggregate transaction data (Total Transaction Amount, Frequency) and merge with Profile demographics.

In [8]:
# Rename id in profile to customer_id for consistent merging
profile_clean.rename(columns={'id': 'customer_id'}, inplace=True)

# 1. Aggregate Transaction Data
transactions = transcript_clean[transcript_clean['event'] == 'transaction']
transaction_agg = transactions.groupby('customer_id')['amount'].agg(['sum', 'count', 'mean']).rename(columns={
    'sum': 'total_amount',
    'count': 'transaction_count',
    'mean': 'average_transaction_value'
})

# 2. Offers interactions (Simplified for Phase 1)
# Just counting how many offers received/completed
offer_events = transcript_clean[transcript_clean['event'] != 'transaction']
offer_agg = pd.crosstab(offer_events['customer_id'], offer_events['event'])

# 3. Merge everything into customer_360
customer_360 = profile_clean.set_index('customer_id')
customer_360 = customer_360.join(transaction_agg, how='left')
customer_360 = customer_360.join(offer_agg, how='left')

# Fill NaN for customers with no transactions/offers
customer_360.fillna(0, inplace=True)

print("Customer 360 View Shape:", customer_360.shape)
display(customer_360.head())

Customer 360 View Shape: (14825, 12)

,Unnamed: 0,gender,age,became_member_on,income,membership_days,total_amount,transaction_count,average_transaction_value,offer completed,offer received,offer viewed
customer_id,,,,,,,,,,,,
0610b486422d4921ae7d2bf64640c50b,1,F,55,2017-07-15,112000.0,376,77.01,3.0,25.670000,1.0,2.0,0.0
78afa995795e4d85b5d9ceeca43f5fef,3,F,75,2017-05-09,100000.0,443,159.27,7.0,22.752857,3.0,4.0,4.0
e2127556f4f64592b11af22de27a7932,5,M,68,2018-04-26,70000.0,91,57.73,3.0,19.243333,2.0,4.0,3.0
389bc3fa690240e798340f5a15918d5c,8,M,65,2018-02-09,53000.0,167,36.43,3.0,12.143333,5.0,6.0,6.0
2eeac8d8feae4a8cad5a6af0499a211d,12,M,58,2017-11-11,51000.0,257,15.62,4.0,3.905000,1.0,3.0,2.0

## 7. Save Processed Data
Save the merged and cleaned `customer_360_view` DataFrame to a CSV file for the next phase.

In [9]:
# Save to CSV
customer_360.to_csv('../data/customer_360_view.csv')
print("Saved customer_360_view.csv to ../data/")

Saved customer_360_view.csv to ../data/